<a href="https://colab.research.google.com/github/mathewjosephta/Add-on-Python/blob/main/Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
data={
    'Name':['Alice','Bob','Charlie','Diana','Ethan'],
    'Age':[25,30,35,28,34],
    'Department':['IT','Finance','HR','IT','Operations'],
    'Salary':[55000,np.nan,70000,60000,np.nan],
    'joiningDate':['2022-05-15','2021-03-20','2018-08-10','2020-10-05','2015-02-25']
}
df=pd.DataFrame(data)
print(df)

print(df[['Name','Salary']])

Filtered_df=df[df['Age']>30]
print(Filtered_df)

grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

sorted_df = df.sort_values(by='Salary', ascending=False)
print(sorted_df)

      Name  Age  Department   Salary joiningDate
0    Alice   25          IT  55000.0  2022-05-15
1      Bob   30     Finance      NaN  2021-03-20
2  Charlie   35          HR  70000.0  2018-08-10
3    Diana   28          IT  60000.0  2020-10-05
4    Ethan   34  Operations      NaN  2015-02-25
      Name   Salary
0    Alice  55000.0
1      Bob      NaN
2  Charlie  70000.0
3    Diana  60000.0
4    Ethan      NaN
      Name  Age  Department   Salary joiningDate
2  Charlie   35          HR  70000.0  2018-08-10
4    Ethan   34  Operations      NaN  2015-02-25
Department
Finance           NaN
HR            70000.0
IT            57500.0
Operations        NaN
Name: Salary, dtype: float64
      Name  Age  Department   Salary joiningDate
2  Charlie   35          HR  70000.0  2018-08-10
3    Diana   28          IT  60000.0  2020-10-05
0    Alice   25          IT  55000.0  2022-05-15
1      Bob   30     Finance      NaN  2021-03-20
4    Ethan   34  Operations      NaN  2015-02-25

In [ ]:
import pandas as pd
import numpy as np
data={
    'Name':['Alice','Bob','Charlie','Diana','Ethan'],
    'Marks':[95,80,62,89,34],
    'Grade':['S','A','C','A+','F']
}
df=pd.DataFrame(data)
Filtered_df=df[df['Marks']>50]
print(Filtered_df)

      Name  Marks Grade
0    Alice     95     S
1      Bob     80     A
2  Charlie     62     C
3    Diana     89    A+

In [ ]:
import pandas as pd
import numpy as np
data={
    'Name':['Alice','Bob','Charlie','David','Eva'],
    'Age':[25,30,35,40,45],
    'Salary':[50000,60000,70000,80000,90000],
    'Department':['HR','Finance','Tech','Tech','HR'],
    'Experience':[2,5,8,10,12]
}
df=pd.DataFrame(data)
sorted_df = df.sort_values(by=['Department', 'Salary'], ascending=[True, False])

print(sorted_df)

print("Top 5 rows of the sorted DataFrame :")
print(sorted_df.head(5))

      Name  Age  Salary Department  Experience
1      Bob   30   60000    Finance           5
4      Eva   45   90000         HR          12
0    Alice   25   50000         HR           2
3    David   40   80000       Tech          10
2  Charlie   35   70000       Tech           8
Top 5 rows of the sorted DataFrame :
      Name  Age  Salary Department  Experience
1      Bob   30   60000    Finance           5
4      Eva   45   90000         HR          12
0    Alice   25   50000         HR           2
3    David   40   80000       Tech          10
2  Charlie   35   70000       Tech           8

In [ ]:
import pandas as pd
import numpy as np
data={
    'Name':['Alice','Bob','Charlie','David','Eva'],
    'Age':[25,30,35,40,45],
    'Salary':[50000,60000,70000,80000,90000],
    'Department':['HR','Finance','Tech','Tech','HR'],
    'Experience':[2,5,8,10,12]
}
df=pd.DataFrame(data)
Filtered_df = df[(df['Salary'] > 60000) & (df['Experience'] > 5) & (df['Department'] == 'Tech')]
print(Filtered_df[['Name','Salary','Department']])

      Name  Salary Department
2  Charlie   70000       Tech
3    David   80000       Tech

In [ ]:
import pandas as pd
import numpy as np
data={
    'Name':['Alice','Bob','Charlie','Diana','Ethan','Alice'],
    'Age':[25,30,35,28,34,25],
    'Department':['IT','Finance','HR','IT','Operations','IT'],
    'Salary':[55000,np.nan,70000,60000,np.nan],
    'joiningDate':['2022-05-15','2021-03-20','2018-08-10','2020-10-05','2015-02-25']
}
df=pd.DataFrame(data)
print(df)
df_dropped = df.dropna()
print(df_dropped)
df_columns = df.dropna(axis=1)
print(df_columns)
df_filled_fixed=df.fillna(value=0)
print(df_filled_fixed)

      Name  Age  Department   Salary joiningDate
0    Alice   25          IT  55000.0  2022-05-15
1      Bob   30     Finance      NaN  2021-03-20
2  Charlie   35          HR  70000.0  2018-08-10
3    Diana   28          IT  60000.0  2020-10-05
4    Ethan   34  Operations      NaN  2015-02-25
      Name  Age Department   Salary joiningDate
0    Alice   25         IT  55000.0  2022-05-15
2  Charlie   35         HR  70000.0  2018-08-10
3    Diana   28         IT  60000.0  2020-10-05

In [ ]:
import pandas as pd
import numpy as np
data={
    'Name':['Alice','Bob','Charlie','Diana','Ethan','Alice'],
    'Age':[25,30,35,28,34,25],
    'Department':['IT','Finance','HR','IT','Operations','IT']
}
df=pd.DataFrame(data)
duplicates=df.duplicated()
print(duplicates)
df_no_duplicates=df.drop_duplicates()
print(df_no_duplicates)

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool
      Name  Age  Department
0    Alice   25          IT
1      Bob   30     Finance
2  Charlie   35          HR
3    Diana   28          IT
4    Ethan   34  Operations

In [ ]:
import pandas as pd
df1=pd.DataFrame({
    'ID':[1,2,3],
    'Name':['Alice','Bob','Charlie']
})

df2=pd.DataFrame({
    'ID':[2,3,4],
    'Score':[85,90,95]
})

merged=pd.merge(df1,df2)
print(merged)

   ID     Name  Score
0   2      Bob     85
1   3  Charlie     90

In [ ]:
import pandas as pd
df1=pd.DataFrame({
    'ID':[1,2,3],
    'Name':['Alice','Bob','Charlie']
})

df2=pd.DataFrame({
    'ID':[2,3,4],
    'Score':[85,90,95]
})

merged=pd.merge(df1,df2)
print(merged)